In [20]:
import pandas as pd
import numpy as np

In [36]:
###Series의 메서드

In [38]:
nums = pd.Series(range(500))
nums

0        0
1        1
2        2
3        3
4        4
      ...
495    495
496    496
497    497
498    498
499    499
Length: 500, dtype: int64

In [40]:
##.head()
#앞에서 일부 데이터 확인
#디폴트 값 - 5

nums.head()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [57]:
##.tail()
#뒤에서 일부 데이터 확인

nums.tail()

495    495
496    496
497    497
498    498
499    499
dtype: int64

In [6]:
nums = pd.Series([1,2,np.nan,4,5])
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [7]:
hello = pd.Series(list('hello'))
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [58]:
##.nunique()
#고유한 값의 개수 계산

hello.nunique()

4

In [59]:
##.count()
#데이터의 개수 / NaN 값은 포함 X

nums.count()

500

In [60]:
##len()함수
#데이터 전체의 길이 / NaN 포함

len(nums)

#NaN의 개수

len(nums) - nums.count()

0

In [61]:
##.sum()
# 데이터 전체의 합 / NaN 포함 X

nums.sum()

124750

In [62]:
##.mean()    : 평균
##.std()     : 표준편차
##.median()  : 중앙값
##.max()     : 최대값
##.min()     : 최소값

In [56]:
##문자인 경우에 max(),min()

#ord()함수 
#하나의 문자를 Unicode 숫자로 변경
#그 크기를 가지고 최대, 최소 구해줌
somechar = pd.Series(list('AaBbCc'))
somechar

#ord('a') : 97 > ord('A') : 65   -> 소문자가 더 큼

somechar.max()
somechar.min()

'A'

In [35]:
##.describe()
#통계 계산을 한번에 

#Series가 수치값인 경우
#count, mean, std, min, 25%, median, 75%, max
nums.describe()

#Series가 object인 경우
#count,unique,top(최빈값),freq(최빈값의 빈도)
hello.describe()

count     5
unique    4
top       l
freq      2
dtype: object

In [158]:
##.sort_values()
#정렬

#ascending = True : 오름차순  / Fales :내림차순
#na_position = 'first' : nan 값을 맨 위에 /  'last' : nan 값을 맨 밑에
hello.sort_values()

1    e
0    h
2    l
3    l
4    o
dtype: object

In [31]:
###Series의 변환
#Series -> list, dict

#list 함수
list(nums)

#dict 함수
#key : Series의 index , values : Series의 values
dict(nums)

{0: 1.0, 1: 2.0, 2: nan, 3: 4.0, 4: 5.0}

In [50]:
superheros = [
    "Batman",
    "Superman",
    "Spider-Man",
    "Iron Man",
    "Captain America",
    "Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)

a = pd.Series(strength_levels,index = superheros)

In [63]:
dict(a)

{'Batman': 100,
 'Superman': 120,
 'Spider-Man': 90,
 'Iron Man': 95,
 'Captain America': 110,
 'Wonder Woman': 120}

In [68]:
###Pandas 데이터 입출력

##CSV 파일데이터 읽어오기
#CSV(Comman Seperated Values) : 콤마로 구분되는 텍스트 파일

In [70]:
#파일 불러오기
#파일 경로 - 해당 파일 우클릭 -> copy path

pd.read_csv('datas/pokemon.csv')

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [119]:
##Series 데이터로 읽어오기

#index_col : 인덱스로 사용할 column의 이름
#.squeeze()  :하나의 열을 갖는 DataFrame을 Series로 변환 / columns방향 , row방향

pokemons = pd.read_csv('datas/pokemon.csv',index_col = 'Pokemon').squeeze('columns')
pokemons

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [120]:
pokemons.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [126]:
pokemons.sort_values()   #오름차순

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [129]:
pokemons.sort_values(ascending=False) #내림차순

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [179]:
#parse_dates 인수  : 날짜/시간 자료만 따로 파싱 

google = pd.read_csv('datas/google_stocks.csv',
            parse_dates =['Date'],        # Date column을 날짜/시간 자료로 파싱
            index_col='Date').squeeze()

In [157]:
#usecols 인수 : 필요한 column만 지정해서 가져옴

war = pd.read_csv('datas/revolutionary_war.csv',
            parse_dates = ['Start Date'],
            index_col = 'Start Date',
            usecols = ['Start Date','State']).squeeze()
war

len(war)- war.count()   #nan  / war.isnull().sum()
war.count()             #nan 제외 
war.nunique()           #고유값

17

In [163]:
#정렬

war.sort_values(na_position = 'first')
war.sort_values(na_position = 'last')

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [162]:
### nan값 배제
#.dropna()

war.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [178]:
##.sort_index()
#index 기준으로 정렬

#ascending = True :오름차순
#na_position  = 'first'  ,'last'

pokemons.sort_index()

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [168]:
war.sort_index()

#NaT : Not a Time 
#날짜/시간 유형의 데이터   /  NaN은 float

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [171]:
war.sort_index(na_position = 'first')

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [197]:
###index에 NaT배제하기

#.dropna()
#자료에 중복이 없을 때 사용
war.loc[war.index.dropna()] 

#.notnull()
war.loc[war.index.notnull()]

#자료에 중복이 있어서 두 결과값에 차이가 생김

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [192]:
#상위 10개 데이터

google.sort_values(ascending = False).head(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [193]:
#하위 10개 데이터

google.sort_values().head(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [207]:
##.nsmallest()
#작은 값을 순서대로 인수만큼
google.nsmallest(10)

##.nlargest()
#큰 값을 순서대로 인수만큼
google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [215]:
##.value_counts()
#고유한 값의 빈도 
#정보를 카테고리화 해서 요약

#문자
pokemons.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [211]:
google.describe()

count    3824.000000
mean      479.945860
std       328.528592
min        49.820000
25%       235.860000
50%       314.680000
75%       708.205000
max      1287.580000
Name: Close, dtype: float64

In [232]:
#수치형 데이터 

#bins 인수 =  값의 구간을 갖는 리스트 
#리스트대로 구간 나눠서 도수 구함

bins = np.linspace(0,1400,8)
bins

google.value_counts(bins = bins)  #()는 구간 미포함 , [] 구간 포함

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [235]:
#bins 인수 = 정수
#정수만큼 구간을 나눠줌
#구간의 크기가 일정하지 않을 수 있음

google.value_counts(bins=8,sort=False)   #sort : 정렬 유무

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [262]:
data = {'c1':[1,2,'누락'],
        'c2':[1.11,'',3.33],
        'c3':['one','two','three']
       }

df_csv = pd.DataFrame(data)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [318]:
###Pandas 데이터를 CSV로 저장
##.to_csv(path,..,index = )

#path : 파일경로
#index : True - 인덱스 저장 / False - 인덱스 저장 X
#df_csv는 index가 없으니까 False 지정

df_csv.to_csv('datas/sample1.csv',index=False)   #sample1.csv파일 이름으로 저장

In [289]:
df_read = pd.read_csv('datas/sample1.csv')
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [290]:
#header : True  - column 저장 / False : 저장 X

df_csv.to_csv('datas/sample1.csv',index=False,header=False)

In [292]:
#names = []
#column index 정보 직접 입력

df_read = pd.read_csv('datas/sample1.csv',names = ['c1','c2','c3'])
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [304]:
##콤마로 구분되어 있지 않은 txt 저장

In [300]:
%%writefile datas/sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing datas/sample3.txt

In [306]:
##txt 파일 불러오기
#데이터를 구분하는 구분자가 콤마(comma)가 아니면 sep 인수로 구분자 지정
#sep = '\s+'  -> 길이가 정해지지 않은 공백의 구분자

pd.read_table('datas/sample3.txt', sep = '\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [309]:
#파일 안에 부가적인 텍스트가 있는 경우
#부가적인 텍스트를 제외하고 데이터만 불러오기

In [307]:
%%writefile datas/sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing datas/sample4.txt

In [312]:
#skiprows()
#해당 행은 건너뛰고 데이터 불러오기

pd.read_csv('datas/sample4.txt',skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [319]:
#na_values ()
#자료 안 특정값을 NaN으로 취급

df_na_val = pd.read_csv('datas/sample1.csv',na_values=['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [321]:
#sep = ''
#구분자 변경

df_na_val.to_csv('datas/sample5.txt',sep='|')

In [322]:
#na_rep = ''
#해당 인수를 NaN으로 저장

df_na_val.to_csv('datas/sample6.csv',na_rep='누락')

In [327]:
#온라인 CSV 파일 불러오기

titanic = pd.read_csv('https://storage.googleapis.com/tf-datasets/titanic/train.csv')
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [326]:
titanic.head(10)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y

In [339]:
air = pd.read_csv('datas/서울교통공사_지하역사 공기질 측정 정보_20211231.csv', encoding="cp949")

In [340]:
air

,연번,호선,역명,미세먼지,초미세먼지,이산화탄소,포름알데히드,일산화탄소,이산화질소,휘발성유기화합물,라돈
0,1,1,시청,54.600,27.900000,490.0,5.1,0.6,0.030,26.1,35.366667
1,2,1,종각,103.575,66.050000,590.0,6.3,1.1,0.052,104.3,33.650000
2,3,1,종로3가,58.800,39.200000,491.0,6.6,0.9,0.042,32.5,25.400000
3,4,1,종로5가,88.100,48.333333,667.0,7.9,1.1,0.038,291.3,30.433333
4,5,1,동대문,69.000,42.350000,528.0,7.5,1.1,0.044,95.5,40.550000
...,...,...,...,...,...,...,...,...,...,...,...
250,251,8,남한산성입구,36.400,26.600000,521.5,11.7,1.2,0.020,116.7,40.400000
251,252,8,단대오거리,31.400,20.100000,444.0,6.9,1.0,0.019,117.4,20.900000
252,253,8,신흥,39.200,19.900000,458.0,14.8,1.1,0.019,63.5,27.200000
253,254,8,수진,36.800,22.300000,459.5,19.7,1.0,0.019,186.6,23.600000
254,255,8,모란,39.800,29.800000,473.0,10.6,0.9,0.019,89.2,27.200000

In [390]:
import requests
response = requests.get('https://api.odcloud.kr/api/15024830/v1/uddi:a60824f0-bd93-41fd-94fd-d38b9e4beb02?page=1&perPage=10&returnType=JSON',
                       params={
                           'serviceKey': 'mVnox/0TH6h7tKAZCqbx4CSGUirWCiLeUvcdWzz4X9dQzhPBE8pgKKak6n3entF1n2h3t8/5BctvfDHdZ7b27w=='})

response.status_code

200

In [391]:
response.headers['Content-Type']

'application/json; charset=UTF-8'

In [392]:
import json
response.json()

air1 = pd.DataFrame(response.json()['data'])

air1.to_csv('datas/air1.csv')